ahtn/keyplus/ports/nrf52/src/ble_test.c
#define SEC_PARAM_BOND                      1                          /**< Perform bonding. */
#define SEC_PARAM_MITM                      0                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                      0                          /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS                  0                          /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES           BLE_GAP_IO_CAPS_NONE               /**< No I/O capabilities. */
#define SEC_PARAM_OOB                       0                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE              7                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE              16                         /**< Maximum encryption key size. */

#define OUTPUT_REPORT_MAX_LEN               1                          /**< Maximum length of Output Report. */
#define INPUT_REPORT_KEYS_INDEX             0                          /**< Index of Input Report. */
#define OUTPUT_REPORT_BIT_MASK_CAPS_LOCK    0x02                       /**< CAPS LOCK bit in Output Report (based on 'LED Page (0x08)' of the Universal Serial Bus HID Usage Tables). */
#define INPUT_REP_REF_ID                    0                          /**< Id of reference to Keyboard Input Report. */
#define OUTPUT_REP_REF_ID                   0                          /**< Id of reference to Keyboard Output Report. */

#define MAX_BUFFER_ENTRIES                  5                          /**< Number of elements that can be enqueued */

#define BASE_USB_HID_SPEC_VERSION           0x0101                     /**< Version number of base USB HID Specification implemented by this application. */

#define INPUT_REPORT_KEYS_MAX_LEN           8                          /**< Maximum length of the Input Report characteristic. */

#define DEAD_BEEF                           0xDEADBEEF                     /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE           APP_TIMER_SCHED_EVENT_DATA_SIZE        /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#define SCHED_QUEUE_SIZE                    20                         /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#define SCHED_QUEUE_SIZE                    10                         /**< Maximum number of events in the scheduler queue. */
#endif

#define MODIFIER_KEY_POS                    0                          /**< Position of the modifier byte in the Input Report. */
#define SCAN_CODE_POS                       2                          /**< The start position of the key scan code in a HID Report. */
#define SHIFT_KEY_CODE                      0x02                       /**< Key code indicating the press of the Shift Key. */

#define MAX_KEYS_IN_ONE_REPORT              (INPUT_REPORT_KEYS_MAX_LEN - SCAN_CODE_POS)/**< Maximum number of key presses that can be sent in one Input Report. */

/**Buffer queue access macros
 *
 * @{ */
/** Initialization of buffer list */
#define BUFFER_LIST_INIT()     \
    do                         \
    {                          \
        buffer_list.rp    = 0; \
        buffer_list.wp    = 0; \
        buffer_list.count = 0; \
    } while (0)

/** Provide status of data list is full or not */
#define BUFFER_LIST_FULL() \
    ((MAX_BUFFER_ENTRIES == buffer_list.count - 1) ? true : false)

/** Provides status of buffer list is empty or not */
#define BUFFER_LIST_EMPTY() \
    ((0 == buffer_list.count) ? true : false)

#define BUFFER_ELEMENT_INIT(i)                 \
    do                                         \
    {                                          \
        buffer_list.buffer[(i)].p_data = NULL; \
    } while (0)

/** @} */

enum {
    BSP_EVENT_KEY_0_RELEASE = (BSP_EVENT_KEY_LAST+1),
    BSP_EVENT_KEY_1_RELEASE,
    BSP_EVENT_KEY_2_RELEASE,
    BSP_EVENT_KEY_3_RELEASE,
};

/** Abstracts buffer element */
typedef struct hid_key_buffer {
    uint8_t data_offset;  /**< Max Data that can be buffered for all entries */
    uint8_t data_len;     /**< Total length of data */
    uint8_t *p_data;      /**< Scanned key pattern */
    ble_hids_t *p_instance;
                  /**< Identifies peer and service instance */
} buffer_entry_t;

STATIC_ASSERT(sizeof(buffer_entry_t) % 4 == 0);

/** Circular buffer list */
typedef struct {
    buffer_entry_t buffer[MAX_BUFFER_ENTRIES];
                           /**< Maximum number of entries that can enqueued in the list */
    uint8_t rp;                /**< Index to the read location */
    uint8_t wp;                /**< Index to write location */
    uint8_t count;                 /**< Number of elements in the list */
} buffer_list_t;

STATIC_ASSERT(sizeof(buffer_list_t) % 4 == 0);

APP_TIMER_DEF(m_battery_timer_id);                  /**< Battery timer. */
BLE_HIDS_DEF(m_hids,                            /**< Structure used to identify the HID service. */
         NRF_SDH_BLE_TOTAL_LINK_COUNT,
         BLE_INPUT_REPORT_SIZE_BOOT_KB,
         BLE_INPUT_REPORT_SIZE_MOUSE,
         BLE_INPUT_REPORT_SIZE_SYSTEM,
         BLE_INPUT_REPORT_SIZE_CONSUMER,
         BLE_INPUT_REPORT_SIZE_NKRO,
         BLE_INPUT_REPORT_SIZE_VENDOR,
         BLE_OUTPUT_REPORT_SIZE_BOOT_KB,
         BLE_OUTPUT_REPORT_SIZE_VENDOR
         );
BLE_BAS_DEF(m_bas);                         /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                 /**< Advertising module instance. */

static bool m_in_boot_mode = false;                 /**< Current protocol mode. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;        /**< Handle of the current connection. */
static sensorsim_cfg_t m_battery_sim_cfg;               /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;               /**< Battery Level sensor simulator state. */
static bool m_caps_on = false;                      /**< Variable to indicate if Caps Lock is turned on. */
static pm_peer_id_t m_peer_id;                      /**< Device reference handle to the current bonded central. */
static buffer_list_t buffer_list;                   /**< List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */

static ble_uuid_t m_adv_uuids[] =
    { {BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE} };

