ahtn/keyplus/ports/nrf52/src/ble_test.c
/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                          (const uint8_t *)DEVICE_NAME,
                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Queued Write Module.
 */
static void qwr_init(void)
{
    ret_code_t err_code;
    nrf_ble_qwr_init_t qwr_init_obj = { 0 };

    qwr_init_obj.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init_obj);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Device Information Service.
 */
static void dis_init(void)
{
    ret_code_t err_code;
    ble_dis_init_t dis_init_obj;
    ble_dis_pnp_id_t pnp_id;

    pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
    pnp_id.vendor_id = PNP_ID_VENDOR_ID;
    pnp_id.product_id = PNP_ID_PRODUCT_ID;
    pnp_id.product_version = PNP_ID_PRODUCT_VERSION;

    memset(&dis_init_obj, 0, sizeof(dis_init_obj));

    ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str,
                  MANUFACTURER_NAME);
    dis_init_obj.p_pnp_id = &pnp_id;

    dis_init_obj.dis_char_rd_sec = SEC_JUST_WORKS;

    err_code = ble_dis_init(&dis_init_obj);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Battery Service.
 */
static void bas_init(void)
{
    ret_code_t err_code;
    ble_bas_init_t bas_init_obj;

    memset(&bas_init_obj, 0, sizeof(bas_init_obj));

    bas_init_obj.evt_handler = NULL;
    bas_init_obj.support_notification = true;
    bas_init_obj.p_report_ref = NULL;
    bas_init_obj.initial_batt_level = 100;

    bas_init_obj.bl_rd_sec = SEC_JUST_WORKS;
    bas_init_obj.bl_cccd_wr_sec = SEC_JUST_WORKS;
    bas_init_obj.bl_report_rd_sec = SEC_JUST_WORKS;

    err_code = ble_bas_init(&m_bas, &bas_init_obj);
    APP_ERROR_CHECK(err_code);
}

#include "usb/util/usb_hid.h"
#include "usb/util/hut_keyboard.h"
#include "usb/util/hut_led.h"
#include "usb/util/hut_desktop.h"
#include "usb/util/hut_consumer.h"


/**@brief Function for initializing HID Service.
 */
static void hids_init(void)
{
    ret_code_t err_code;
    ble_hids_init_t hids_init_obj;
    ble_hids_inp_rep_init_t *p_input_report;
    ble_hids_outp_rep_init_t *p_output_report;
    // ble_hids_feature_rep_init_t * p_feature_report;
    uint8_t hid_info_flags;

    static ble_hids_inp_rep_init_t input_report_array[BLE_INPUT_REPORT_COUNT];
    static ble_hids_outp_rep_init_t output_report_array[BLE_OUTPUT_REPORT_COUNT];
    static ble_hids_feature_rep_init_t feature_report_array[BLE_FEATURE_REP_COUNT];

    static uint8_t report_map_data[] = {
        // Boot keyboard report: 0
        HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
        HID_USAGE(1), HID_USAGE_KEYBOARD,
        HID_COLLECTION(1), HID_COLLECTION_APPLICATION,
            HID_REPORT_ID(1)       , BLE_REPORT_ID_BOOT_KB,
            // modifiers
            HID_USAGE_PAGE(1), HID_USAGE_PAGE_KEYBOARD,
            HID_USAGE_MINIMUM(1), KC_LEFT_CONTROL,
            HID_USAGE_MAXIMUM(1), KC_RIGHT_GUI,
            HID_LOGICAL_MINIMUM(1), 0x00,
            HID_LOGICAL_MAXIMUM(1), 0x01,
            HID_REPORT_COUNT(1), 0x08,
            HID_REPORT_SIZE(1), 0x01,
            HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
            // reserved/OEM
            HID_REPORT_COUNT(1), 0x01,
            HID_REPORT_SIZE(1), 0x08,
            HID_INPUT(1), IOF_CONSTANT | IOF_VARIABLE | IOF_ABSOLUTE,
            // keycodes
            HID_LOGICAL_MINIMUM(1), KC_NONE,
            HID_LOGICAL_MAXIMUM(1), KC_RIGHT_GUI,
            HID_USAGE_MINIMUM(1), KC_NONE,
            HID_USAGE_MAXIMUM(1), KC_RIGHT_GUI,
            HID_REPORT_COUNT(1), 0x06,
            // HID_REPORT_SIZE(1)     , 0x08, // Reuse global item
            HID_INPUT(1), IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
            // LEDs
            HID_USAGE_PAGE(1), HID_USAGE_PAGE_LEDS,
            HID_LOGICAL_MINIMUM(1), 0x00,
            HID_LOGICAL_MAXIMUM(1), 0x01,
            HID_USAGE_MINIMUM(1), HID_LED_Num_Lock,
            HID_USAGE_MAXIMUM(1), HID_LED_Kana,
            HID_REPORT_COUNT(1), 0x05,
            HID_REPORT_SIZE(1), 0x01,
            HID_OUTPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
            // leftover
            HID_REPORT_COUNT(1), 0x01,
            HID_REPORT_SIZE(1), 0x03,
            HID_OUTPUT(1), IOF_CONSTANT | IOF_VARIABLE | IOF_ABSOLUTE,
        HID_END_COLLECTION(0),

#if 1
        //
        // Mouse report: 1
        //
        HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
        HID_USAGE(1), HID_USAGE_MOUSE,
        HID_COLLECTION(1), HID_COLLECTION_APPLICATION,
            HID_REPORT_ID(1), BLE_REPORT_ID_MOUSE,
            // mouse
            HID_USAGE(1), HID_USAGE_POINTER,
            HID_COLLECTION(1), HID_COLLECTION_PHYSICAL,
                // mouse buttons
                HID_USAGE_PAGE(1), HID_USAGE_PAGE_BUTTON,
                HID_LOGICAL_MINIMUM(1), 0,
                HID_LOGICAL_MAXIMUM(1), 1,
                HID_USAGE_MINIMUM(1), 1,
                HID_USAGE_MAXIMUM(1), 16,
                HID_REPORT_COUNT(1), 16,
                HID_REPORT_SIZE(1), 1,
                HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
                // mouse X, Y
                HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
                HID_USAGE(1), HID_USAGE_X,
                HID_USAGE(1), HID_USAGE_Y,
                HID_LOGICAL_MINIMUM(2), DB16(INT16_MIN),
                HID_LOGICAL_MAXIMUM(2), DB16(INT16_MAX),
                HID_REPORT_COUNT(1), 2,
                HID_REPORT_SIZE(1), 16,
                HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
                // mouse wheel
                HID_USAGE(1), HID_USAGE_WHEEL,
                HID_LOGICAL_MINIMUM(1), DB8(INT8_MIN),
                HID_LOGICAL_MAXIMUM(1), DB8(INT8_MAX),
                HID_REPORT_COUNT(1), 1,
                HID_REPORT_SIZE(1), 8,
                HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
                // mouse pan wheel
                HID_USAGE_PAGE(1), HID_USAGE_PAGE_CONSUMER,
                HID_USAGE(2), DB16(HID_CONSUMER_AC_PAN),
                // HID_LOGICAL_MINIMUM(1) , DB8(INT8_MIN), // Reuse global item
                // HID_LOGICAL_MAXIMUM(1) , DB8(INT8_MAX), // Reuse global item
                // HID_REPORT_COUNT(1)    , 1, // Reuse global item
                // HID_REPORT_SIZE(1)     , 8, // Reuse global item
                HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
            HID_END_COLLECTION(0),
        HID_END_COLLECTION(0),
#endif

#if 1
        //
        // System report
        //
        HID_USAGE_PAGE(1) , HID_USAGE_PAGE_GENERIC_DESKTOP, // Generic Desktop
        HID_USAGE(1)      , HID_USAGE_SYSTEM_CONTROL,
        HID_COLLECTION(1) , HID_COLLECTION_APPLICATION,
            HID_REPORT_ID(1)       , BLE_REPORT_ID_SYSTEM,
            // hid system code
            HID_LOGICAL_MINIMUM(1) , DB8(0x01),
            HID_LOGICAL_MAXIMUM(2) , DB16(HID_DESKTOP_System_Display_LCD_Autoscale),
            HID_USAGE_MINIMUM(1)   , DB8(0x01),
            HID_USAGE_MAXIMUM(2)   , DB16(HID_DESKTOP_System_Display_LCD_Autoscale),
            HID_REPORT_SIZE(1)     , 16,
            HID_REPORT_COUNT(1)    , 1,
            HID_INPUT(1)           , IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
        HID_END_COLLECTION(0),
#endif

#if 1
        //
        // Consumer report
        //
        HID_USAGE_PAGE(1) , HID_USAGE_PAGE_CONSUMER,
        HID_USAGE(1)      , HID_CONSUMER_CONSUMER_CONTROL,
        HID_COLLECTION(1) , HID_COLLECTION_APPLICATION,
            HID_REPORT_ID(1)       , BLE_REPORT_ID_CONSUMER,
            // hid consumer code
            HID_LOGICAL_MINIMUM(1) , DB8(0x01),
            HID_LOGICAL_MAXIMUM(2) , DB16(HID_CONSUMER_AC_DISTRIBUTE_VERTICALLY),
            HID_USAGE_MINIMUM(1)   , DB8(0x01),
            HID_USAGE_MAXIMUM(2)   , DB16(HID_CONSUMER_AC_DISTRIBUTE_VERTICALLY),
            HID_REPORT_SIZE(1)     , 16,
            HID_REPORT_COUNT(1)    , 1,
            HID_INPUT(1)           , IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
        HID_END_COLLECTION(0),
#endif

#if 1
        //
        // NKRO keyboard report
        //
        HID_USAGE_PAGE(1)        , HID_USAGE_PAGE_GENERIC_DESKTOP,
        HID_USAGE(1)             , HID_USAGE_KEYBOARD,
        HID_COLLECTION(1)        , HID_COLLECTION_APPLICATION,
            HID_REPORT_ID(1)       , BLE_REPORT_ID_NKRO,
            // keycode bitmap
            HID_USAGE_PAGE(1)      , HID_USAGE_PAGE_KEYBOARD,
            HID_USAGE_MINIMUM(1)   , KC_LEFT_CONTROL,
            HID_USAGE_MAXIMUM(1)   , KC_RIGHT_GUI,
            HID_LOGICAL_MINIMUM(1) , 0x00,
            HID_LOGICAL_MAXIMUM(1) , 0x01,
            HID_REPORT_COUNT(1)    , 0x08,
            HID_REPORT_SIZE(1)     , 0x01,
            HID_INPUT(1)           , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
            // keycodes
            // HID_LOGICAL_MINIMUM(1) , 0x00, // Reuse global item
            // HID_LOGICAL_MAXIMUM(1) , 0x01, // Reuse global item
            HID_USAGE_MINIMUM(1)   , 0x00,
            HID_USAGE_MAXIMUM(1)   , 0xdf,
            HID_REPORT_COUNT(1)    , 0xe0,
            // HID_REPORT_SIZE(1)     , 0x01, // Reuse global item
            HID_INPUT(1)           , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
        HID_END_COLLECTION(0),
#endif

