ahtn/keyplus/ports/nrf52/src/ble_test.c
void mouse_move(int16_t x, int16_t y) {
    ret_code_t err_code;

    hid_report_mouse_t report = {0};

    report.x = x;
    report.y = y;

    err_code = ble_hids_inp_rep_send(&m_hids,
                                     BLE_INPUT_REPORT_INDEX_MOUSE,
                                     BLE_INPUT_REPORT_SIZE_MOUSE,
                                     (uint8_t *)&report,
                                     m_conn_handle);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        ) {
        APP_ERROR_HANDLER(err_code);
    }
}

void send_consumer(uint16_t code) {
    ret_code_t err_code;

    uint16_t data[1];

    data[0] = code;

    err_code = ble_hids_inp_rep_send(&m_hids,
                                     BLE_INPUT_REPORT_INDEX_CONSUMER,
                                     BLE_INPUT_REPORT_SIZE_CONSUMER,
                                     (uint8_t*)data,
                                     m_conn_handle);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        ) {
        APP_ERROR_HANDLER(err_code);
    }
}

hid_report_nkro_keyboard_t m_nkro_report = {0};

void send_nkro_test(uint8_t key, uint8_t state) {
    ret_code_t err_code;

    if (state) {
        m_nkro_report.bitmask[key/8] |= (1 << (key%8));
    } else {
        m_nkro_report.bitmask[key/8] &= ~(1 << (key%8));
    }

    err_code = ble_hids_inp_rep_send(&m_hids,
                                     BLE_INPUT_REPORT_INDEX_NKRO,
                                     BLE_INPUT_REPORT_SIZE_NKRO,
                                     (uint8_t*)&m_nkro_report,
                                     m_conn_handle);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        ) {
        APP_ERROR_HANDLER(err_code);
    }
}

/**@brief Function for handling the HID Report Characteristic Write event.
 *
 * @param[in]   p_evt   HID service event.
 */
static void on_hid_rep_char_write(ble_hids_evt_t * p_evt)
{
    if (p_evt->params.char_write.char_id.rep_type ==
        BLE_HIDS_REP_TYPE_OUTPUT) {
        ret_code_t err_code;
        uint8_t report_val;
        uint8_t report_index =
            p_evt->params.char_write.char_id.rep_index;

        switch (report_index) {
            case BLE_OUTPUT_REPORT_INDEX_BOOT_KB: {
                // This code assumes that the output report is one byte long. Hence the following
                // static assert is made.
                STATIC_ASSERT(BLE_OUTPUT_REPORT_SIZE_BOOT_KB == 1);

                err_code = ble_hids_outp_rep_get(&m_hids,
                                report_index,
                                BLE_OUTPUT_REPORT_SIZE_BOOT_KB,
                                0,
                                m_conn_handle,
                                &report_val);
                APP_ERROR_CHECK(err_code);

                if (!m_caps_on
                    && ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK)
                    != 0)) {
                    // Caps Lock is turned On.
                    NRF_LOG_INFO("Caps Lock is turned On!");
                    err_code =
                        bsp_indication_set(BSP_INDICATE_ALERT_3);
                    APP_ERROR_CHECK(err_code);

                    keys_send(sizeof(m_caps_on_key_scan_str),
                        m_caps_on_key_scan_str);
                    m_caps_on = true;
                } else if (m_caps_on
                    &&
                    ((report_val &
                        OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) == 0)) {
                    // Caps Lock is turned Off .
                    NRF_LOG_INFO("Caps Lock is turned Off!");
                    err_code =
                        bsp_indication_set(BSP_INDICATE_ALERT_OFF);
                    APP_ERROR_CHECK(err_code);

                    keys_send(sizeof(m_caps_off_key_scan_str),
                        m_caps_off_key_scan_str);
                    m_caps_on = false;
                } else {
                    // The report received is not supported by this application. Do nothing.
                }
            } break;

            case BLE_OUTPUT_REPORT_INDEX_VENDOR: {
                m_output_ready[BLE_OUTPUT_REPORT_INDEX_VENDOR] = 1;
            }
        }
    }
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling HID events.
 *
 * @details This function will be called for all HID events which are passed to the application.
 *
 * @param[in]   p_hids  HID service structure.
 * @param[in]   p_evt   Event received from the HID service.
 */
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt)
{
    switch (p_evt->evt_type) {
    case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
        m_in_boot_mode = true;
        break;

    case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
        m_in_boot_mode = false;
        break;

    case BLE_HIDS_EVT_REP_CHAR_WRITE:
        on_hid_rep_char_write(p_evt);
        break;

    case BLE_HIDS_EVT_NOTIF_ENABLED:
        break;

    default:
        // No implementation needed.
        break;
    }
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt) {
    case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
        NRF_LOG_INFO("High Duty Directed advertising.");
        err_code =
            bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
        APP_ERROR_CHECK(err_code);
        break;

