ahtn/keyplus/ports/nrf52/src/ble_test.c
        reset_hid_reports();
        // reset_usb_reports();

        if (has_critical_error()) {
            NRF_LOG_HEXDUMP_INFO(g_error_code_table, SIZE_ERROR_CODE_TABLE);
            // recovery_mode_main_loop();
            APP_ERROR_HANDLER(0xffff);
        }
    }

    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("HID Keyboard example started.");
    timers_start();
    advertising_start(erase_bonds);

    matrix_scanner_init();

    uint32_t last_time = 0;

    // Enter main loop.
    for (;;) {
        // Log current time (for debugging)
        {
            uint32_t new_time = timer_read_ms();
            if ((uint32_t)(new_time - last_time) >= 1000) {
                NRF_LOG_INFO("time: %d", new_time);
                last_time = new_time;
            }
        }

        // Matrix scanning
        {
            bool scan_changed = false;

            scan_changed |= matrix_scan();
            if (scan_changed) {
                uint8_t matrix_data[32];
                const uint8_t use_deltas = true;
                const uint8_t data_size = get_matrix_data(matrix_data, use_deltas);

                NRF_LOG_INFO("button pressed");

                keyboard_update_device_matrix(GET_SETTING(device_id), matrix_data);
            }

            interpret_all_keyboard_matrices();
        }

        macro_task();
        mouse_key_task();

        if (m_conn_handle != BLE_CONN_HANDLE_INVALID && m_conn_established) {
            send_hid_reports();
        }

        idle_state_handle();
    }
}

/**
 * @}
 */
